app/Models/EnrollmentModel.php

SELECT `courses`.`id`, `courses`.`course_name`, `enrollments`.`enrollment_date`
FROM `enrollments`
JOIN `courses` ON `courses`.`id` = `enrollments`.`course_id`
WHERE `enrollments`.`user_id` = 2
---
    public function getUserEnrollments($user_id)
    {
        return $this->select('courses.id, courses.course_name, enrollments.enrollment_date')
                    ->join('courses', 'courses.id = enrollments.course_id')
                    ->where('enrollments.user_id', $user_id)
                    ->findAll();